Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceCurveChainIsTooClosedToGridlines Property
 A chain formed by these curve elements defines a splitter which lies too close to gridlines and will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceCurveChainIsTooClosedToGridlines { get; }
Public Shared ReadOnly Property DividedSurfaceCurveChainIsTooClosedToGridlines As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainIsTooClosedToGridlines {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceCurveChainIsTooClosedToGridlines : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace